app/views/tickets/new.html.erb

    <div>
        <%= f.collection_select :project_id, Project.all, :id, :name %>
---
SELECT "projects".* FROM "projects"