app/views/updates/new.html.erb

SELECT "tickets".* FROM "tickets"
---
       <%= f.label :ticket_id, "Select a Ticket to update" %>
       <%= f.collection_select :ticket_id, Ticket.all, :id, :ticket_and_project, include_blank: true %>