app/controllers/sessions_controller.rb

   def create
     #does user exist?
     @user = User.find_by(username: params[:user][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "richrosenthal"], ["LIMIT", 1]]