app/controllers/tickets_controller.rb

  def create
    @ticket = Ticket.new(ticket_params)
    @ticket.user_id = session[:user_id]
    if @ticket.save
---
INSERT INTO "tickets" ("title", "description", "project_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)