app/controllers/updates_controller.rb

  def new
    @ticket = Ticket.find_by_id(params[:ticket_id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @update = current_user.updates.build(update_params)
    if @update.save
---
INSERT INTO "updates" ("content", "user_id", "ticket_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def show
    @update = Update.find_by_id(params[:id])
---
SELECT "updates".* FROM "updates" WHERE "updates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]