app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
   def show
    @user = User.find_by_id(params[:id]) #will send an error code vs if use find method